{
    "Resilience": {
        "When the first snow arrives, how do you handle it?": [
            "I get stuck in a snow pile immediately.",
            "I wobble around like a penguin on ice, but sometimes make it home.",
            "I wobble around but march on like a frostbitten champion.",
            "I barely notice — I’m basically invincible."
        ],
        "How would you survive a playful roast or insult?": [
            "One jab and I’m a puddle of embarrassment.",
            "I stumble a bit, but might survive a couple hits.",
            "I bounce back like a human rubber ball.",
            "I laugh, clap, and then roast everyone back — untouchable."
        ]
    },
    "Stealth": {
        "When you first arrive at a friend's house, how noticeable are you?": [
            "I announce my arrival like a marching band.",
            "I make a tiny ripple, like a pebble in a pond.",
            "I sneak in like a ninja avoiding laser beams.",
            "I’m basically a ghost — undetected for months or even years."
        ],
        "At the end of a workday, how do you usually leave?": [
            "I storm out like a celebrity paparazzi can’t miss.",
            "I mix subtlety with flair — a dramatic ninja exit.",
            "I tiptoe quietly like a cat on velvet paws.",
            "I vanish without a trace — the Houdini of exits."
        ]
    },
    "Chaos/Disruption": {
        "When you show up to a party, what usually happens?": [
            "Nothing much — I glide in like a calm breeze through a quiet room.",
            "Small chaos brews — like a whoopee cushion at a fancy dinner.",
            "Stuff blows up — figuratively, mostly.",
            "Everything collapses into glorious, epic chaos."
        ],
        "How would people describe your everyday behavior?": [
            "Predictable as a microwave beep.",
            "Surprising now and then — like socks in the fridge.",
            "Often unpredictable — like a cat on espresso.",
            "No one has any idea what I’ll do next — chaos incarnated."
        ]
    },
    "Creativity/Innovation": {
        "How would you describe your skill set?": [
            "Basic but reliable — like plain toast.",
            "I’ve got a few tricks up my sleeve — nothing illegal, probably.",
            "Specialized talents — people gasp and then ask me to show off.",
            "One-of-a-kind abilities — basically a superhero origin story in real life."
        ],
        "How often do people notice or comment on your abilities?": [
            "Almost never — I’m like a hidden Easter egg.",
            "Occasionally — people notice and go 'huh, neat.'",
            "Frequently — my talents get applause.",
            "Constantly — I’m basically a legend walking among mortals."
        ]
    },
    "Teamwork/Sociability": {
        "How do you feel about working with others?": [
            "I mostly operate solo — lone wolf vibes.",
            "I collaborate sometimes… usually by accident.",
            "I need the group like coffee needs cream.",
            "I’m basically powered by teamwork. No team, no me."
        ],
        "How much do you rely on others to thrive?": [
            "I don’t need anyone — I’m a one-person show.",
            "I get a tiny boost from others — like sprinkles on a cupcake.",
            "I strongly depend on relationships — like a student needs coffee.",
            "I can’t function without a team — like plants and sunlight."
        ]
    },
    "Intensity/Danger": {
        "How dangerous are you considered to be?": [
            "Mostly harmless — like juggling rubber knives.",
            "Mildly risky — like a fluffy kitten… that might scratch.",
            "Very dangerous — handle with extreme caution.",
            "Among the most dangerous known — proceed at your own peril."
        ],
        "How intense are the problems you cause when things go wrong?": [
            "Easy to control — like a runaway shopping cart.",
            "Noticeable but manageable — like a toddler with spaghetti.",
            "Severe and hard to stop — like glitter after a craft project.",
            "Devastating and overwhelming — like fireworks in a library."
        ]
    }
}